<?php

declare(strict_types=1);

return [
    [
        'id' => 1,
        'date' => '2016-12-11 12:34',
        'update_date' => '2016-12-11 12:34',
        'category_id' => 1,
        'author_id' => 2,
        'alias' => 'post-with-edu-series-episodes',
        'title' => 'Пост с эпизодами',
        'short' => <<<'TEXT'
            <p>Провели ленивый импровизированный стрим на общеполезные темы.
            Чем неудобен в разработке процедурный код и код без разделения.
            Какие сложности предметной области обнаруживаются при анализе бизнеса.
            Про сходства и различия фреймворков.
            Про использование интерфейсов и классов провайдеров для конфигурирования
            приложения и для организации гибкой модульности.</p>
            TEXT,
        'short_purified' => <<<'TEXT'
            <p>Провели ленивый импровизированный стрим на общеполезные темы.
            Чем неудобен в разработке процедурный код и код без разделения.
            Какие сложности предметной области обнаруживаются при анализе бизнеса.
            Про сходства и различия фреймворков.
            Про использование интерфейсов и классов провайдеров для конфигурирования
            приложения и для организации гибкой модульности.</p>
            TEXT,
        'text' => '[{widget:deworker-series-episodes|slug=interactive-site}]',
        'text_purified' => '<p>[{widget:deworker-series-episodes|slug=interactive-site}]</p>',
        'meta_title' => '',
        'meta_description' => '',
        'group_id' => 1,
        'public' => 1,
        'image' => 'df4bae6510cb42c308ac7ca1b6aeacf5.jpg',
        'image_width' => 250,
        'image_height' => 180,
        'image_alt' => '',
        'image_show' => 0,
    ],
    [
        'id' => 2,
        'date' => '2016-12-11 12:34',
        'update_date' => '2016-12-11 12:34',
        'category_id' => 1,
        'author_id' => 2,
        'alias' => 'post-with-youtube',
        'title' => 'Пост с Youtube видео',
        'short' => <<<'TEXT'
            <p>Провели ленивый импровизированный стрим на общеполезные темы.
            Чем неудобен в разработке процедурный код и код без разделения.
            Какие сложности предметной области обнаруживаются при анализе бизнеса.
            Про сходства и различия фреймворков.
            Про использование интерфейсов и классов провайдеров для конфигурирования
            приложения и для организации гибкой модульности.</p>
            TEXT,
        'short_purified' => <<<'TEXT'
            <p>Провели ленивый импровизированный стрим на общеполезные темы.
            Чем неудобен в разработке процедурный код и код без разделения.
            Какие сложности предметной области обнаруживаются при анализе бизнеса.
            Про сходства и различия фреймворков.
            Про использование интерфейсов и классов провайдеров для конфигурирования
            приложения и для организации гибкой модульности.</p>
            TEXT,
        'text' => '[{widget:youtube|id=000001}]',
        'text_purified' => '<p>[{widget:youtube|id=000001}]</p>',
        'meta_title' => '',
        'meta_description' => '',
        'group_id' => 1,
        'public' => 1,
        'image' => '88909e623c21d6e005f37cdbd3c98c22.jpg',
        'image_width' => 250,
        'image_height' => 180,
        'image_alt' => '',
        'image_show' => 0,
    ],
    [
        'id' => 3,
        'date' => '2016-12-11 12:34',
        'update_date' => '2016-12-11 12:34',
        'category_id' => 1,
        'author_id' => 2,
        'alias' => 'post-with-edu-series-episodes',
        'title' => 'Пост с комментариями',
        'short' => <<<'TEXT'
            <p>Провели ленивый импровизированный стрим на общеполезные темы.
            Чем неудобен в разработке процедурный код и код без разделения.
            Какие сложности предметной области обнаруживаются при анализе бизнеса.
            Про сходства и различия фреймворков.
            Про использование интерфейсов и классов провайдеров для конфигурирования
            приложения и для организации гибкой модульности.</p>
            TEXT,
        'short_purified' => <<<'TEXT'
            <p>Провели ленивый импровизированный стрим на общеполезные темы.
            Чем неудобен в разработке процедурный код и код без разделения.
            Какие сложности предметной области обнаруживаются при анализе бизнеса.
            Про сходства и различия фреймворков.
            Про использование интерфейсов и классов провайдеров для конфигурирования
            приложения и для организации гибкой модульности.</p>
            TEXT,
        'text' => <<<'TEXT'
            <p>Провели ленивый импровизированный стрим на общеполезные темы.
            Чем неудобен в разработке процедурный код и код без разделения.
            Какие сложности предметной области обнаруживаются при анализе бизнеса.
            Про сходства и различия фреймворков.
            Про использование интерфейсов и классов провайдеров для конфигурирования
            приложения и для организации гибкой модульности.</p>
            TEXT,
        'text_purified' => <<<'TEXT'
            <p>Провели ленивый импровизированный стрим на общеполезные темы.
            Чем неудобен в разработке процедурный код и код без разделения.
            Какие сложности предметной области обнаруживаются при анализе бизнеса.
            Про сходства и различия фреймворков.
            Про использование интерфейсов и классов провайдеров для конфигурирования
            приложения и для организации гибкой модульности.</p>
            TEXT,
        'meta_title' => '',
        'meta_description' => '',
        'group_id' => 1,
        'public' => 1,
        'image' => 'df4bae6510cb42c308ac7ca1b6aeacf5.jpg',
        'image_width' => 250,
        'image_height' => 180,
        'image_alt' => '',
        'image_show' => 1,
    ],
];
